app/controllers/stocks_controller.rb

SELECT "stocks".* FROM "stocks"
---
  def index
    @stocks = Stock.all

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    @stock = Stock.find(params[:id])

INSERT INTO "stocks" ("idStock", "namaBarang", "hargaBarang", "jumlagStock", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["idStock", 1], ["namaBarang", "Biskuat"], ["hargaBarang", 500], ["jumlagStock", 10], ["created_at", "2019-03-04 14:25:15.372531"], ["updated_at", "2019-03-04 14:25:15.372531"]]
---
  def create
    @stock = Stock.new(stock_params)

    if @stock.save

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @stock = Stock.find(params[:id])

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "stocks" SET "namaBarang" = $1, "updated_at" = $2 WHERE "stocks"."id" = $3  [["namaBarang", "Biskuat Coklat"], ["updated_at", "2019-03-04 14:29:38.094277"], ["id", 1]]
---
  def update
    @stock = Stock.find(params[:id])

    if @stock.update(stock_params)