app/controllers/transactions_controller.rb

SELECT  "transactions".* FROM "transactions" WHERE "transactions"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
---
  def show
    @transaction = Transaction.find(params[:id])

SELECT "stocks".* FROM "stocks"
---
  def new
    @transaction  = Transaction.new
    @stocks       = Stock.all

SELECT  "stocks".* FROM "stocks" WHERE "stocks"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
INSERT INTO "transactions" ("totalTransaction", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["totalTransaction", 15000], ["created_at", "2019-03-05 15:39:15.478171"], ["updated_at", "2019-03-05 15:39:15.478171"]]
INSERT INTO "details" ("transaction_id", "stock_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["transaction_id", 10], ["stock_id", 1], ["amount", 4], ["created_at", "2019-03-05 15:50:26.463231"], ["updated_at", "2019-03-05 15:50:26.463231"]]
---
  def create

    step          = params[:step]

    if step == 'preview'
      total     = 0
      @keranjang = params[:keranjang]
      @keranjang.each do |index, val|
        item  = Stock.find_by(id: index)
        total += (val.to_i * item.hargaBarang)
      end

      @bayar = total
      @transaction  = Transaction.new

    elsif step == 'save'

      @transaction = Transaction.new(transaction_params)

      if @transaction.save

        keranjang = params[:keranjang]
        keranjang.each do |index, val|
          Detail.create(transaction_id: @transaction.id, stock_id: index, amount:val )